DataProcessors/АР_ПодборПараметровРасшифровкиПлатежаДляАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>АР_ПодборПараметровРасшифровкиПлатежаДляАренды</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодбиратьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДляПодбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_ПериодАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_СчетНаАренду</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_УслугаАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_Депозит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АР_Пени</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаНаАренду</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетНаАренду</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/АР_СпособыПогашенияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>АР_СпособыПогашенияПени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СперваПениПотомОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СперваОсновнойДолгПотомПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестиОбособленныйУчетПени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/АР_ВидыОперацийСчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>АР_ВидыОперацийСчетНаАренду</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/АР_ПодборПараметровРасшифровкиПлатежаДляАренды/Forms/ПодборПоСчетам/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьДанныеПоСчетам(АдресВременногоХранилища, НазначениеПлатежа)
			
	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить();
	РасшифровкаПлатежа.Очистить();
	
	НазначениеПлатежа = "Оплата по счетам";
	Для Каждого СтрокаТЧ Из Объект.СчетаНаАренду Цикл
		
		ПараметрыНачисленияПени = АР_ПроцедурыНачисления.ПолучитьПараметрыНачисленияПени(СтрокаТЧ.ДоговорКонтрагента, СтрокаТЧ.СчетНаАренду.Дата);
		ОбособленныйУчетПени = ?(ПараметрыНачисленияПени = Неопределено, Ложь, ПараметрыНачисленияПени.СпособПогашенияПени = ПредопределенноеЗначение("Перечисление.АР_СпособыПогашенияПени.ВестиОбособленныйУчетПени"));
		
		ОстатокСуммыСписания = СтрокаТЧ.Сумма;
		Для Каждого СтрокаСчета Из СтрокаТЧ.СчетНаАренду.Состав  Цикл
			
			СуммаВзаиморасчетов = СтрокаСчета.Сумма + ?(СтрокаТЧ.СчетНаАренду.СуммаВключаетНДС, 0, СтрокаСчета.СуммаНДС);
			СуммаСписания = Мин(ОстатокСуммыСписания, СуммаВзаиморасчетов);
			СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
			СтрокаПлатеж.СуммаПлатежа = СуммаСписания;
			
			СтрокаПлатеж.АР_ОбъектАренды = СтрокаСчета.ОбъектАренды;
			СтрокаПлатеж.АР_УслугаАренды = СтрокаСчета.Номенклатура;
			СтрокаПлатеж.АР_ПериодАренды = СтрокаСчета.ПериодАренды;
			СтрокаПлатеж.АР_СчетНаАренду = СтрокаТЧ.СчетНаАренду;
			СтрокаПлатеж.АР_Депозит = ЗначениеЗаполнено(СтрокаТЧ.СчетНаАренду) И СтрокаТЧ.СчетНаАренду.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
			СтрокаПлатеж.АР_Пени = ЗначениеЗаполнено(СтрокаТЧ.СчетНаАренду) И СтрокаТЧ.СчетНаАренду.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени И ОбособленныйУчетПени;
			СтрокаПлатеж.СтавкаНДС = СтрокаСчета.СтавкаНДС;
			
			Если СтрокаТЧ.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам И Не ЗначениеЗаполнено(СтрокаПлатеж.АР_ПериодАренды) Тогда
				СтрокаПлатеж.АР_ПериодАренды = АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(СтрокаТЧ.СчетНаАренду.НачалоПериода, СтрокаТЧ.ДоговорКонтрагента);
			КонецЕсли;
			
			ОстатокСуммыСписания = ОстатокСуммыСписания - СуммаСписания;
			Если ОстатокСуммыСписания <= 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		Если ОстатокСуммыСписания > 0 Тогда
			
			СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
			СтрокаПлатеж.АР_СчетНаАренду = СтрокаТЧ.СчетНаАренду;
			СтрокаПлатеж.СуммаПлатежа = ОстатокСуммыСписания;
			СтрокаПлатеж.АР_Депозит = ЗначениеЗаполнено(СтрокаТЧ.СчетНаАренду) И СтрокаТЧ.СчетНаАренду.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
			СтрокаПлатеж.АР_Пени = ЗначениеЗаполнено(СтрокаТЧ.СчетНаАренду) И СтрокаТЧ.СчетНаАренду.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени И ОбособленныйУчетПени;
			
		КонецЕсли;
		НазначениеПлатежа = НазначениеПлатежа + " " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТЧ.СчетНаАренду.Номер, Истина, Истина) + ",";
	КонецЦикла;	
	Если Прав(НазначениеПлатежа, 1) = "," Тогда
		НазначениеПлатежа = Лев(НазначениеПлатежа, СтрДлина(НазначениеПлатежа) - 1);
	КонецЕсли;
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(РасшифровкаПлатежа, Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоОтборуНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_СчетНаАренду.Ссылка КАК СчетНаАренду,
	|	АР_СчетНаАренду.СуммаДокумента КАК Сумма,
	|	АР_СчетНаАренду.ДоговорКонтрагента
	|ИЗ
	|	Документ.АР_СчетНаАренду КАК АР_СчетНаАренду
	|ГДЕ
	|	АР_СчетНаАренду.Контрагент = &Контрагент
	|	И ВЫБОР
	|			КОГДА &ДатаКон = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА АР_СчетНаАренду.ОкончаниеПериода >= &ДатаНач
	|			ИНАЧЕ АР_СчетНаАренду.НачалоПериода <= &ДатаКон
	|					И АР_СчетНаАренду.ОкончаниеПериода >= &ДатаНач
	|		КОНЕЦ
	|	И НЕ АР_СчетНаАренду.ПометкаУдаления
	|	И (АР_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
	|			ИЛИ &ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|	И АР_СчетНаАренду.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(ОкончаниеПериода), КонецДня(ОкончаниеПериода), ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СчетаНаАренду.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		НачалоПериода = Результат.ДатаНачала;
		ОкончаниеПериода = Результат.ДатаОкончания;	
	КонецЕсли;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = "Подбор по контрагенту " + Контрагент;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилища = "";
	НазначениеПлатежа = "";
	ЗаполнитьДанныеПоСчетам(АдресВременногоХранилища, НазначениеПлатежа);
	ЭтаФорма.Закрыть(Новый Структура("АдресВременногоХранилища, НазначениеПлатежа", АдресВременногоХранилища, НазначениеПлатежа));	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	АР_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(НачалоПериода, ОкончаниеПериода, Неопределено, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоОтбору(Команда)
	
	ДобавитьПоОтборуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Объект.СчетаНаАренду.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		ЭтаФорма.Контрагент = Параметры.Контрагент;	
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ЭтаФорма.Организация = Параметры.Организация;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаАрендуСчетНаАрендуПриИзменении(Элемент)
	
	ТекДанные = Элементы.СчетаНаАренду.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.СчетНаАренду) Тогда
		РеквизитыСчета = АР_ОбщиеПроцедуры.ЗначенияРеквизитовОбъекта(ТекДанные.СчетНаАренду,"ДоговорКонтрагента, СуммаДокумента");
		ТекДанные.ДоговорКонтрагента = РеквизитыСчета.ДоговорКонтрагента; 	
		ТекДанные.Сумма = РеквизитыСчета.СуммаДокумента; 	
	Иначе
		Объект.СчетаНаАренду.Удалить(Объект.СчетаНаАренду.Индекс(ТекДанные));
	КонецЕсли;
	
КонецПроцедуры
